{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 64, 128, 3], "arguments": {}, "trainable": true, "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "relu", "nb_col": 1, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 1, "activity_regularizer": null, "bias": true, "W_regularizer": null, "name": "convolution2d_1", "nb_filter": 1, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_1", "momentum": 0.99, "axis": -1, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "relu", "nb_col": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "bias": true, "W_regularizer": null, "name": "convolution2d_2", "nb_filter": 6, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_2", "momentum": 0.99, "axis": -1, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "relu", "nb_col": 1, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 1, "activity_regularizer": null, "bias": true, "W_regularizer": null, "name": "convolution2d_3", "nb_filter": 1, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_3", "momentum": 0.99, "axis": -1, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.1, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "init": "uniform", "b_constraint": null, "input_dim": 7812, "activity_regularizer": null, "activation": "linear", "name": "dense_1", "b_regularizer": null}}], "keras_version": "1.2.1"}